{"sitedata":[{"sitename":"DmitryBanningLewis","icon":"/img/favicon.png","logo":"/img/logo-webservices.png","metadesc":"Trusted By Fine Real Estate Professionals","metauthor":"Fly My Community","metakeyword":"cms","footer":"All rights reserved! 2018 WebriQ Pte Ltd"}],"content":[{"email":"dmitry@pixvid.net","logo":"/img/logofly.png","linkcont":"4178445357","videoid":"233413663","sliderbg":"/img/slider_bg.jpg","sliderbg_video":"https://player.vimeo.com/video/250014579?background=1","slidertext1":"When You're Hear, You'll Know it.","slidertext2":"Colorado's premiere master planned development - Banning Lewis Ranch","poplink":"//vimeo.com/250014579"}],"about":[{"abouttext1":"Banning Lewis","abouttext2":"If you read about our views on architectural character, you may get the feeling that we're setting some elevated standards for the homes that will be built here. And that feeling would be correct. We've established architectural guidelines that touch on everything from porch size and garage placement to which chimney designs are appropriate for a Prairie-style home. The idea is to create homes that honor the heritage of this place. And respect the busy lives of our homebuyers.     After carefully crafting our guidelines, we then selected a group of Guest Builders who could implement them in our first village, Northtree. We looked for companies with good reputations. Companies that emphasize customer service. And, perhaps most of all, companies that were up for a new challenge.     Each of our broker-friendly Guest Builders is creating all-new home designs for Northtree, with base pricing from the low $200s to the $500s. In fact, each village is planned to have its own unique collection of homes. So as our master-planned community grows, it will become a colorful mosaic of individual neighborhoods rather than a sprawling homogenous mass. And with a full range of home styles, Banning Lewis Ranch should have something for just about everyone.","aboutbg":"/img/aboutfly_bg.png"}],"updatedDate":"2018-01-22T09:57:14.183Z"}